Revit 2016 API
ReinforcementSettings.DocumentContainsNoAreaOrPathReinforcement Method
 Checks whether the document is free of AreaReinforcement and PathReinforcement elements. Only in this case is it permissible to change the HostStructuralRebar property. Only in this case it is allowed to change RebarShapeDefinesHooks property.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Since: 2013
Syntax
C#
[ObsoleteAttribute("This method will be obsolete from 2016. Use FilteredElementCollector instead.")]
public bool DocumentContainsNoAreaOrPathReinforcement()
Visual Basic
<ObsoleteAttribute("This method will be obsolete from 2016. Use FilteredElementCollector instead.")> _
Public Function DocumentContainsNoAreaOrPathReinforcement As Boolean
Visual C++
[ObsoleteAttribute(L"This method will be obsolete from 2016. Use FilteredElementCollector instead.")]
public:
bool DocumentContainsNoAreaOrPathReinforcement()
See Also
ReinforcementSettings Class
Autodesk.Revit.DB.Structure Namespace